CSI API ETABS v1

# cCaseStaticNonlinearStagedGetMaterialNonlinearity Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetMaterialNonlinearity(
    	string Name,
    	ref bool TimeDepMatProp
    )

    Function GetMaterialNonlinearity (
    	Name As String,
    	ByRef TimeDepMatProp As Boolean
    ) As Integer

    Dim instance As cCaseStaticNonlinearStaged
    Dim Name As String
    Dim TimeDepMatProp As Boolean
    Dim returnValue As Integer

    returnValue = instance.GetMaterialNonlinearity(Name,
    	TimeDepMatProp)

    int GetMaterialNonlinearity(
    	String^ Name,
    	bool% TimeDepMatProp
    )

    abstract GetMaterialNonlinearity :
            Name : string *
            TimeDepMatProp : bool byref -> int

#### Parameters

Name

    Type: SystemString

TimeDepMatProp

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cCaseStaticNonlinearStaged
Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com